Revit 2024 API
Stairs.ActualTreadsNumber Property
 The number of treads actually created in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int ActualTreadsNumber { get; }
Visual Basic
Public ReadOnly Property ActualTreadsNumber As Integer
	Get
Visual C++
public:
property int ActualTreadsNumber {
	int get ();
}
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace